cmsis-svd/cmsis-svd/data/Nuvoton/M030GAE.svd
       <register>
          <name>BPWM_DACTRGEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>BPWM_DACTRGEN</displayName>
          <description>BPWM Trigger DAC Enable Register</description>
          <addressOffset>0xF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZTE</name>
              <description>BPWM Zero Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to zero if this bit is set to1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM period point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM period point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PTE</name>
              <description>BPWM Period Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to (PERIODn+1) if this bit is set to1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM period point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM period point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE0</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE1</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE2</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE3</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE4</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CUTRGE5</name>
              <description>BPWM Compare Up Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter counts up to CMP if this bit is set to1.\nNote: This bit should keep at 0 when BPWM counter operating in down counter type..</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Up point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Up point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE0</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE1</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE2</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE3</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE4</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CDTRGE5</name>
              <description>BPWM Compare Down Count Point Trigger DAC Enable Bits\nBPWM can trigger DAC to start action when BPWM counter down count to CMP if this bit is set to1.\nNote 1: This bit should keep at 0 when BPWM counter operating in up counter type.\nNote 2: In complementary mode, CDTRGEN1, 3, 5 is used as another CDTRGEN for channel 0, 2, 4.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>BPWM Compare Down count point trigger DAC function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>BPWM Compare Down count point trigger DAC function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
