cmsis-svd/cmsis-svd/data/Nuvoton/M030GAE.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MANCH</name>
      <description>Manchester Register Map</description>
      <groupName>Manchester</groupName>
      <baseAddress>0x400BC000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>MANCH_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>MANCH_CTL</displayName>
          <description>Manchester Function Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0246C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODESEL</name>
              <description>Manchester Mode Selection\nNote: All the change of function setting shall be during Manchester Controller disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Manchester function is disabled</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Mode 1 modulation signal format is selected</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Mode 2 modulation signal format is selected</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>The other modulation signal format is selected. (The register of MANCH_PREAM shall be set according to its frame information.)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DEGSEL</name>
              <description>Received Deglitch Selection\nThe bits field is used to define how much width of glitch would be filtered.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>disable to the Manchester deglitch selection</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Filter the glitches that the width is 0.25us or less</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Filter the glitches that the width is 0.50us or less</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Filter the glitches that the width is 0.75us or less</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Filter the glitches that the width is 1.00us or less</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Filter the glitches that the width is 1.25us or less</description>
                    <value>#101</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MECT</name>
              <description>Manchester Encoding Type\nLevel 0: the signal is half cycle high and transfer to half cycle low\nLevel 1: the signal is half cycle low and transfer to half cycle high.\nNote: Please refer to Figure 6.165.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>G.E Thomas format</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>IEEE 802.3 format</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LSB</name>
              <description>Manchester Code LSB First\nNote: This bit should be configured before MODSEL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Manchester code is MSB first</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Manchester code is LSB first</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>Transmit Signal Invert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The transmitting data is not inverted</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The transmitting data is inverted</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>Receive Signal Invert</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The received data is not inverted</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The received data is inverted</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RBNULEN</name>
              <description>Received Bit Clock Number Auto Upload Enable Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RBITNUM is not updated by CRBITNUM at each data frame beginning</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RBITNUM is updated by CRBITNUM at each data frame beginning</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRBNULEN</name>
              <description>Current Received Bit Clock Number Auto Upload Enable Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRBITNUM is not updated in each received byte during message receiving period</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRBITNUM is updated in each received byte during message receiving period</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DEGDIV</name>
              <description>Manchester Deglitch Clock Divider\nThe bits field indicates the deglitched clock frequency. The detail is described in Deglitch Selection section.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTXE2TEN</name>
              <description>Manchester Coded Edge Output Enable Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Manchester coded edge signal outputs to Timer Controller Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Manchester coded edge signal outputs to Timer Controller Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MANCHTEN</name>
              <description>Manchester Transmit Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Manchester Transmit Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Manchester Transmit Enabled. It will be cleared to 0 after the data frame transmission done</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BITREFDIV</name>
              <description>Manchester Bit Reference Clock Divider\nThe bits field indicates the reference clock frequency for Manchester bit sample.\nFor example, if the PCLK0 is 72 MHz, the BITREFDIV can be set as 0x23 (BITREFDIV+1). It will generate 2 MHz reference clock frequency and the Manchester transmitting or receiving data is sampled with the reference divided clock.\nNote 1: The BITREFDIV minimum value is 0x03.\nNote 2: It is suggested that minimize the BITREFDIV value to make the TBITNUM or RTIBNUM value be greater than 0x64.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>MANCH_PREAM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>MANCH_PREAM</displayName>
          <description>Manchester Preamble Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble Format\nThe bits field defines the preamble pattern in the modulation signal format.\nIf MODESEL is 2'b10, the PREAMBLE will be set as 0x7E.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRENUM</name>
              <description>Preamble Number\nThe bits field defines the number of preamble in the modulation signal format.\n00000: means there are 32 preamble patterns.\n00001: means there is 1 preamble pattern.\n00010: means there are 2 preamble patterns.\n00011: means there are 3 preamble patterns.\nand so on\nIf MODESEL is 2'b01, the PRENUM will be set as 0x5.\nIf MODESEL is 2'b10, the PRENUM will be set as 0x4.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEPAT</name>
              <description>Idle Pattern\nThe bits field indicates the bus idle pattern.\nIf it is 0x00, it indicates that the bus idle default is low.\nIf it is 0xFF, it indicates that the bus idle default is high.\nExcept the bus idle state is LOW, the bits field must be set before the Controller is Enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMTNUM</name>
              <description>Modulation Format Transmit Number\nThe bits field defines the number of transmitted byte number in current selected mode.\nIf MODESEL is 0x1, the FMTNUM will be forced as 0x1E.\nIf MODESEL is 0x2, the FMTNUM will be forced as 0x40.\nIf MODESEL is 0x3, the modulation transmit number will be FMTNUM.\nNote 1: If FMTNUM is 0x00, which indicates the transmit number is 256 Bytes.\nNote 2: The value of FMTNUM must be greater than PRENUM\nNote 3: The minimum value of FMTNUM must be greater than 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>MANCH_FIFOCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>MANCH_FIFOCTL</displayName>
          <description>Manchester FIFO Control Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCLR</name>
              <description>Transmit FIFO Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Both of Transmit FIFO and Manchester Transmit encoded FIFO are not cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Both of Transmit FIFO and Manchester Transmit encoded FIFO are cleared</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLR</name>
              <description>Received FIFO Clear\nNote: The received control includes the FIFO and receive state machine. For example, if there is noise in the bus, the Manchester Controller will report BITERR flag when it detects the bit width greater than the setting. If the number of bit error event is greater than the software threshold, then set RXCLR to reset the receive state machine. The Manchester Controller will re-detect the IDLEPAT again.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Received control is not cleared</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Received control is cleared</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFCNT</name>
              <description>Transmitted FIFO Count (Read Only)\nThe bits field indicates the current counter number of transmitted FIFO for transmitting data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFCNT</name>
              <description>Received FIFO Count (Read Only)\nThe bits field indicates the current counter number of received FIFO for decoded data.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MTXFCNT</name>
              <description>Manchester Transmit Encoded FIFO Count (Read Only)\nThe bits field indicates the current counter number of transmitted encoded FIFO for encoded data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>MANCH_DMAC</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>MANCH_DMAC</displayName>
          <description>Manchester DMA Control Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MTXDMAEN</name>
              <description>Manchester Code Transmit DMA Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Manchester Code Transmit DMA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Manchester Code Transmit DMA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>Transmit DMA Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transmit DMA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transmit DMA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>Received DMA Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Received DMA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Received DMA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
