cmsis-svd/cmsis-svd/data/Nuvoton/M030GAE.svd
       <register>
          <name>DAC1_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_CTL</displayName>
          <description>DAC1 Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DACEN</name>
              <description>DAC Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAC Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAC Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DACIEN</name>
              <description>DAC Interrupt Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAC interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAC interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Mode Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAURIEN</name>
              <description>DMA Under-run Interrupt Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA under-run interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA under-run interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGEN</name>
              <description>Trigger Mode Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAC event trigger mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAC event trigger mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Source Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Software trigger</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Timer 2 trigger</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Timer 0 trigger</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Timer 1 trigger</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Timer 3 trigger</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Timer 4 trigger</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>BPWM 1 trigger</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Timer 5 trigger</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass Buffer Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Output voltage buffer Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Output voltage buffer Disabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LALIGN</name>
              <description>DAC Data Left-aligned Enable Control</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Right alignment</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Left alignment</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ETRGSEL</name>
              <description>External Pin Trigger Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Low level trigger</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>High level trigger</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Falling edge trigger</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Rising edge trigger</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BWSEL</name>
              <description>DAC Data Bit-width Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data is 12 bits</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data is 8 bits</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC1_SWTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_SWTRG</displayName>
          <description>DAC1 Software Trigger Control Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRG</name>
              <description>Software Trigger\nNote: Writing this bit will generate one shot pulse and this bit is cleared to 0 by hardware automatically; Reading this bit will always get 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Software trigger Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Software trigger Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC1_DAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_DAT</displayName>
          <description>DAC1 Data Holding Register</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DACDAT</name>
              <description>DAC 12-bit Holding Data\nThese bits are written by user software which specifies 12-bit conversion data for DAC output. The unused bits (DAC1_DAT[3:0] in left-alignment mode and DAC1_DAT[15:12] in right alignment mode) are ignored by DAC controller hardware.\n12-bit left alignment: user has to load data into DAC1_DAT[15:4] bits.\n12-bit right alignment: user has to load data into DAC1_DAT[11:0] bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC1_DATOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_DATOUT</displayName>
          <description>DAC1 Data Output Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATOUT</name>
              <description>DAC 12-bit Output Data\nThese bits are current digital data for DAC output conversion.\nIt is loaded from DAC1_DAT register and user cannot write it directly.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC1_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_STATUS</displayName>
          <description>DAC1 Status Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINISH</name>
              <description>DAC Conversion Complete Finish Flag\nNote: This bit set to 1 when conversion time counter counts to SETTLET. It is cleared to 0 when DAC starts a new conversion. Write 1 to clear this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAC is in conversion state</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAC conversion finished</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAUDR</name>
              <description>DMA Under-run Interrupt Flag\nNote: Write 1 to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No DMA under-run error condition occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA under-run error condition occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>DAC Busy Flag (Read Only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAC is ready for the next conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAC is busy in conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC1_TCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC1_TCTL</displayName>
          <description>DAC1 Timing Control Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETTLET</name>
              <description>DAC Output Conversion Cycles \nUser software needs to write appropriate value to these bits to meet DAC conversion settling time based on PCLK (APB clock) speed.\nFor example, DAC controller clock speed is 72 MHz and DAC conversion settling time is 1 us, and SETTLET value must be greater than 0x48.\nNote: The DAC output conversion cycles is SETTLET + 1 PCLK cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DAC_ADCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DAC_ADCTL0</displayName>
          <description>DAC Auto Data Control Register0</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTODATA</name>
              <description>Data Input of Auto Data Generation Function\nUser software needs to write appropriate data value to these bits for DAC auto data generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL1</name>
          <displayName>DAC_ADCTL1</displayName>
          <description>DAC Auto Data Control Register1</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL2</name>
          <displayName>DAC_ADCTL2</displayName>
          <description>DAC Auto Data Control Register2</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL3</name>
          <displayName>DAC_ADCTL3</displayName>
          <description>DAC Auto Data Control Register3</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL4</name>
          <displayName>DAC_ADCTL4</displayName>
          <description>DAC Auto Data Control Register4</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL5</name>
          <displayName>DAC_ADCTL5</displayName>
          <description>DAC Auto Data Control Register5</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL6</name>
          <displayName>DAC_ADCTL6</displayName>
          <description>DAC Auto Data Control Register6</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL7</name>
          <displayName>DAC_ADCTL7</displayName>
          <description>DAC Auto Data Control Register7</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL8</name>
          <displayName>DAC_ADCTL8</displayName>
          <description>DAC Auto Data Control Register8</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL9</name>
          <displayName>DAC_ADCTL9</displayName>
          <description>DAC Auto Data Control Register9</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL10</name>
          <displayName>DAC_ADCTL10</displayName>
          <description>DAC Auto Data Control Register10</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL11</name>
          <displayName>DAC_ADCTL11</displayName>
          <description>DAC Auto Data Control Register11</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL12</name>
          <displayName>DAC_ADCTL12</displayName>
          <description>DAC Auto Data Control Register12</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL13</name>
          <displayName>DAC_ADCTL13</displayName>
          <description>DAC Auto Data Control Register13</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL14</name>
          <displayName>DAC_ADCTL14</displayName>
          <description>DAC Auto Data Control Register14</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL15</name>
          <displayName>DAC_ADCTL15</displayName>
          <description>DAC Auto Data Control Register15</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL16</name>
          <displayName>DAC_ADCTL16</displayName>
          <description>DAC Auto Data Control Register16</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL17</name>
          <displayName>DAC_ADCTL17</displayName>
          <description>DAC Auto Data Control Register17</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL18</name>
          <displayName>DAC_ADCTL18</displayName>
          <description>DAC Auto Data Control Register18</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL19</name>
          <displayName>DAC_ADCTL19</displayName>
          <description>DAC Auto Data Control Register19</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL20</name>
          <displayName>DAC_ADCTL20</displayName>
          <description>DAC Auto Data Control Register20</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL21</name>
          <displayName>DAC_ADCTL21</displayName>
          <description>DAC Auto Data Control Register21</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL22</name>
          <displayName>DAC_ADCTL22</displayName>
          <description>DAC Auto Data Control Register22</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL23</name>
          <displayName>DAC_ADCTL23</displayName>
          <description>DAC Auto Data Control Register23</description>
          <addressOffset>0xBC</addressOffset>
       </register>
