cmsis-svd/cmsis-svd/data/Nuvoton/M030GAE.svd
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL24</name>
          <displayName>DAC_ADCTL24</displayName>
          <description>DAC Auto Data Control Register24</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL25</name>
          <displayName>DAC_ADCTL25</displayName>
          <description>DAC Auto Data Control Register25</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL26</name>
          <displayName>DAC_ADCTL26</displayName>
          <description>DAC Auto Data Control Register26</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL27</name>
          <displayName>DAC_ADCTL27</displayName>
          <description>DAC Auto Data Control Register27</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL28</name>
          <displayName>DAC_ADCTL28</displayName>
          <description>DAC Auto Data Control Register28</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL29</name>
          <displayName>DAC_ADCTL29</displayName>
          <description>DAC Auto Data Control Register29</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL30</name>
          <displayName>DAC_ADCTL30</displayName>
          <description>DAC Auto Data Control Register30</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="DAC_ADCTL0">
          <name>DAC_ADCTL31</name>
          <displayName>DAC_ADCTL31</displayName>
          <description>DAC Auto Data Control Register31</description>
          <addressOffset>0xDC</addressOffset>
       </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
